#include <reg51.h>	    //此文件中定义了51的一些特殊功能寄存器

//源码来自KR电子，个人学习后添加注释

/********************************************************************
* 名称 : Delay(unsigned char ms)
* 功能 : 延时,
* 输入 : del
* 输出 : 无
***********************************************************************/
void delayms(unsigned char ms)	
{						
	unsigned char i;
	while(ms--)
	{
		for(i = 0; i < 120; i++); //单循坏内相当于1ms
	}
}


/********************************************************************
* 名称 : Main()
* 功能 : 主函数
* 输入 : 无
* 输出 : 无
***********************************************************************/
main()
{
	unsigned char LED;
	LED = 0xfe;	  //0xfe = 1111 1110
 	while(1)
	{
	      
    	 P1 = LED;
		 delayms(250);
		 LED = (LED << 1)|1;    //循环左移1位，点亮下一个LED "<<"为左移位,|1使得上一个灯熄灭
		 //LED = (LED << 1);    //循环左移1位，点亮下一个LED "<<"为左移位,上一个灯不熄灭
		 if(LED == 0xff )	 
		 { P1 = LED; LED = 0xfe;  delayms(250);  } // 0xfe = 1111 1110
	}
}

