#include <reg51.h>	    //此文件中定义了51的一些特殊功能寄存器


/********************************************************************
* 名称 : Delay(unsigned char ms)
* 功能 : 延时,
* 输入 : del
* 输出 : 无
源码来自于KR电子，部分注释为本人学习所加
***********************************************************************/
void delayms(unsigned char ms)	
{						
	unsigned char i;
	while(ms--)
	{
		for(i = 0; i < 120; i++); //单循坏内相当于1ms
	}
}


/********************************************************************
* 名称 : Main()
* 功能 : 主函数
* 输入 : 无
* 输出 : 无
***********************************************************************/
main()
{
	unsigned char LED;
	unsigned char i;
	 	while(1)
	{
			LED = 0xfe;	  //0xfe = 1111 1110
			for(i=0;i < 8 ; i++)
			{
					
					P1  = LED;		//赋值LED各灯的亮度 
					delayms(250);
					LED = (LED << 1)|1;    //循环左移1位，点亮下一个LED "<<"为左移位,|1使得上一个灯熄灭
					if (LED == 0x7f)	 break;	  //提前退出 FOR 循环 这句代码很重要，不然进入下一个循环，灯将会持续不亮。可以尝试注释这行代码观看效果
			}
			
				for(i=0;i < 8 ; i++)
			{
					P1  = LED;		//赋值LED各灯的亮度 
					delayms(250);
					LED = LED >> 1;	 // 右移
					LED = LED | 0x80;	 // 移位后，后面的位为高电平
					
			}
	}
}
